STMicroelectronics/STM32CubeL1/Drivers/BSP/STM32L152D_EVAL/stm32l152d_eval_audio.c
  /* Configure the OPAMP if not already configured (on the first occurrence   */
  /* of this function ().                                                     */
  if(HAL_OPAMP_GetState(&hAudioInOpamp) == HAL_OPAMP_STATE_RESET)
  {
    /* Configuration of OPAMP */
    hAudioInOpamp.Init.Mode               = OPAMP_STANDALONE_MODE;
    hAudioInOpamp.Init.NonInvertingInput  = OPAMP_NONINVERTINGINPUT_IO0;
    hAudioInOpamp.Init.InvertingInput     = OPAMP_INVERTINGINPUT_IO0;
    hAudioInOpamp.Init.PowerMode          = OPAMP_POWERMODE_NORMAL;
    hAudioInOpamp.Init.PowerSupplyRange   = OPAMP_POWERSUPPLY_HIGH;
    hAudioInOpamp.Init.UserTrimming       = OPAMP_TRIMMING_FACTORY;

    /* Init MSP of OPAMPx */
    OPAMPx_MspInit(&hAudioInOpamp);
    
    /* Init OPAMPx */
    if (HAL_OPAMP_Init(&hAudioInOpamp) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }
    
  /* Enable OPAMPx */
  if (HAL_OPAMP_Start(&hAudioInOpamp) != HAL_OK)
  {
    return AUDIO_ERROR;
  }  
  
  /*## Configure the ADC #####################################################*/
  
  /* Set ADC instance */
  hAudioInAdc.Instance = ADC1;
  
  /* Deinitialize the ADC peripheral registers to its default reset values */
  HAL_ADC_DeInit(&hAudioInAdc);
  
  /* Configure the ADC */
  /* Configuration of ADCx init structure: ADC parameters and regular group */
  hAudioInAdc.Init.ClockPrescaler        = ADC_CLOCK_ASYNC_DIV1;         /* ADC clock equal to HSI frequency: 16MHz */
  hAudioInAdc.Init.Resolution            = ADC_RESOLUTION_12B;
  hAudioInAdc.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hAudioInAdc.Init.ScanConvMode          = DISABLE;                      /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
  hAudioInAdc.Init.EOCSelection          = ADC_EOC_SEQ_CONV;
  hAudioInAdc.Init.LowPowerAutoWait      = ADC_AUTOWAIT_DISABLE;
  hAudioInAdc.Init.LowPowerAutoPowerOff  = ADC_AUTOPOWEROFF_DISABLE;
  hAudioInAdc.Init.ChannelsBank          = ADC_CHANNELS_BANK_A;
  hAudioInAdc.Init.ContinuousConvMode    = DISABLE;                      /* Continuous mode disabled to have only 1 conversion at each ADC external event trig */
  hAudioInAdc.Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T3_TRGO; /* Trig of conversion start done by external event */
  hAudioInAdc.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_RISING;
  hAudioInAdc.Init.DMAContinuousRequests = ENABLE;
  
  /* Init MSP of ADCx */
  ADCx_MspInit(&hAudioInAdc);

  /* Init ADCx */
  if (HAL_ADC_Init(&hAudioInAdc) != HAL_OK)
  {
    return AUDIO_ERROR;
  }

  /* Configuration of channel on ADCx regular group on rank 1 */
  hAudioInConfigAdc.Channel       = AUDIO_IN_ADC_CHANNEL;
  hAudioInConfigAdc.SamplingTime  = ADC_SAMPLETIME_384CYCLES;  /* With ADC frequency of 16MHz, conversion time will be 24.75us. This is compliant with sampling time of 32kHz (31.25us) or below */
  hAudioInConfigAdc.Rank          = ADC_REGULAR_RANK_1;
  HAL_ADC_ConfigChannel(&hAudioInAdc, &hAudioInConfigAdc);

  
  /*## Configure the Timer ###################################################*/
  
  /* Set TIM3 period to AudioFreq using system clock 32Mhz */
  hAudioInTim3.Instance           = TIM3;
  hAudioInTim3.Init.Period        = (HAL_RCC_GetPCLK1Freq() / (AudioFreq)) -1;
  hAudioInTim3.Init.Prescaler     = 0;
  hAudioInTim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  hAudioInTim3.Init.CounterMode   = TIM_COUNTERMODE_UP;
  
  /* Init MSP of TIMx */
  TIMx_Base_MspInit(&hAudioInTim3);
  
  /* Init TIMx time base */
  HAL_TIM_Base_Init(&hAudioInTim3);
  
  /* Return 0 if all operations are OK */
  return AUDIO_OK;
}

/**
  * @brief  Start audio recording
  * @param  pbuf Main buffer pointer for the recorded data storing  
  * @param  size Current size of the recorded buffer
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Record(uint16_t* pbuf, uint32_t size)
{
  uint32_t                ret = AUDIO_OK;
  TIM_MasterConfigTypeDef master_config = {0};

  if (HAL_ADC_Start_DMA(&hAudioInAdc, (uint32_t*)pbuf, size) == HAL_OK)
  {
    master_config.MasterOutputTrigger = TIM_TRGO_UPDATE;
    master_config.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    
    HAL_TIMEx_MasterConfigSynchronization(&hAudioInTim3, &master_config);
    
    /* Start the time base triggering the ADC */
    if (HAL_TIM_Base_Start(&hAudioInTim3) != HAL_OK)
    {
      ret = AUDIO_ERROR;
    }
  }
  else
  {
    ret = AUDIO_ERROR;
  }
  
  return ret;
}

/**
  * @brief  Stop audio recording
  * @retval None
  */
uint8_t BSP_AUDIO_IN_Stop(void)
{
  uint32_t ret = AUDIO_OK;
  
  /* Stop the time base triggering the ADC */
  if (HAL_TIM_Base_Stop(&hAudioInTim3) != HAL_OK)
  {
    ret = AUDIO_ERROR;
  } 
  
  if (HAL_ADC_Stop_DMA(&hAudioInAdc) != HAL_OK)
  {
    /* Return 0 if all operations are OK */
    ret = AUDIO_ERROR;
  }
  
  /* Disable OPAMPx */
  if (HAL_OPAMP_Stop(&hAudioInOpamp) != HAL_OK)
  {
    ret = AUDIO_ERROR;
  }  
  
  return ret;
}

/**
  * @brief  This function Pauses the audio file stream.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Pause(void)
{    
  uint32_t ret = AUDIO_OK;
  
  /* Stop the time base triggering the ADC */
  if (HAL_TIM_Base_Stop(&hAudioInTim3) != HAL_OK)
  {
    ret = AUDIO_ERROR;
  } 
  
  /* Return AUDIO_OK if all operations are OK */
  return ret;
}

/**
  * @brief  This function Resumes the audio file stream.  
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_Resume(void)
{    
  uint32_t ret = AUDIO_OK;
  
  /* Start the time base triggering the ADC */
  if (HAL_TIM_Base_Start(&hAudioInTim3) != HAL_OK)
  {
    ret = AUDIO_ERROR;
  } 
  
  /* Return AUDIO_OK if all operations are OK */
  return ret;
}

/**
  * @brief Controls the audio in volume level. 
  * @param Volume: Volume level to be set in percentage from 0% to 100% (0 for 
  *         Mute and 100 for Max volume level).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_SetVolume(uint8_t Volume)
{
  /* Set the Global variable AudioInVolume  */
  AudioInVolume = Volume; 
  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief User callback when record buffer is filled
  * @retval None
  */
__weak void BSP_AUDIO_IN_TransferComplete_CallBack(void)
{
  /* This function should be implemented by the user application.
  It is called into this driver when the current buffer is filled
  to prepare the next buffer pointer and its size. */
}

/**
  * @brief  Manages the DMA Half Transfer complete event.
  * @retval None
  */
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{
  /* This function should be implemented by the user application.
     It is called into this driver when the current buffer is filled
     to prepare the next buffer pointer and its size. */
}

/**
  * @brief  Audio IN Error callback function
  * @retval None
  */
__weak void BSP_AUDIO_IN_Error_Callback(void)
{   
  /* This function is called when an Interrupt due to transfer error on or peripheral
       error occurs. */
}

/**
  * @}
  */ 

/** @addtogroup STM32L152D_EVAL_AUDIO_Private_Functions
  * @{
  */ 

